app/controllers/contracts_controller.rb

  def latest_contract
    @contract = Contract.last
---
SELECT  "contracts".* FROM "contracts" ORDER BY "contracts"."id" DESC LIMIT $1  [["LIMIT", 1]]